app/controllers/locations_controller.rb

INSERT INTO "locations" ("address", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "Brest"], ["latitude", 48.390394], ["longitude", -4.486076], ["created_at", "2015-10-22 08:53:54.326407"], ["updated_at", "2015-10-22 08:53:54.326407"]]
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

UPDATE "locations" SET "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["address", "Hendaye"], ["latitude", 43.359399], ["longitude", -1.766148], ["updated_at", "2015-10-28 21:03:12.480567"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @location.update(location_params)